solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.h
/*
 * Copyright 2021-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_PF5020_H_
#define _FSL_PF5020_H_

/*******************************************************************************
 * Includes
 ******************************************************************************/
#include "fsl_common.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define PF5020_DEVICE_ID       0x00U
#define PF5020_REV_ID          0x01U
#define PF5020_EMREV           0x02U
#define PF5020_PROG_ID         0x03U
#define PF5020_INT_STATUS1     0x04U
#define PF5020_INT_MASK1       0x05U
#define PF5020_INT_SENSE1      0x06U
#define PF5020_INT_STATUS2     0x07U
#define PF5020_INT_MASK2       0x08U
#define PF5020_INT_SENSE2      0x09U
#define PF5020_SW_MODE_INT     0x0AU
#define PF5020_SW_MODE_MASK    0x0BU
#define PF5020_SW_ILIM_INT     0x0CU
#define PF5020_SW_ILIM_MASK    0x0DU
#define PF5020_SW_ILIM_SENSE   0x0EU
#define PF5020_LDO_ILIM_INT    0x0FU
#define PF5020_LDO_ILIM_MASK   0x10U
#define PF5020_LDO_ILIM_SENSE  0x11U
#define PF5020_SW_UV_INT       0x12U
#define PF5020_SW_UV_MASK      0x13U
#define PF5020_SW_UV_SENSE     0x14U
#define PF5020_SW_OV_INT       0x15U
#define PF5020_SW_OV_MASK      0x16U
#define PF5020_SW_OV_SENSE     0x17U
#define PF5020_LDO_UV_INT      0x18U
#define PF5020_LDO_UV_MASK     0x19U
#define PF5020_LDO_UV_SENSE    0x1AU
#define PF5020_LDO_OV_INT      0x1BU
#define PF5020_LDO_OV_MASK     0x1CU
#define PF5020_LDO_OV_SENSE    0x1DU
#define PF5020_PWRON_INT       0x1EU
#define PF5020_PWRON_MASK      0x1FU
#define PF5020_PWRON_SENSE     0x20U
#define PF5020_EN_SENSE        0x21U
#define PF5020_SYS_INT         0x22U
#define PF5020_HARDFAULT_FLAGS 0x23U

#define PF5020_ABIST_PGOOD_MON 0x25U
#define PF5020_ABIST_OV1       0x26U
#define PF5020_ABIST_OV2       0x27U
#define PF5020_ABIST_UV1       0x28U
#define PF5020_ABIST_UV2       0x29U
#define PF5020_TEST_FLAGS      0x2AU
#define PF5020_ABIST_RUN       0x2BU

#define PF5020_RANDOM_GEN 0x2DU
#define PF5020_RANDOM_CHK 0x2EU
#define PF5020_VMONEN1    0x2FU
#define PF5020_VMONEN2    0x30U
#define PF5020_CTRL1      0x31U
#define PF5020_CTRL2      0x32U
#define PF5020_CTRL3      0x33U
#define PF5020_PWRUP_CTRL 0x34U

#define PF5020_RESETBMCU_PWRUP 0x36U
#define PF5020_PGOOD_PWRUP     0x37U
#define PF5020_PWRDN_DLY1      0x38U
#define PF5020_PWRDN_DLY2      0x39U
#define PF5020_FREQ_CTRL       0x3AU

#define PF5020_PWRON         0x3CU
#define PF5020_WD_CONFIG     0x3DU
#define PF5020_WD_CLEAR      0x3EU
#define PF5020_WD_EXPIRE     0x3FU
#define PF5020_WD_COUNTER    0x40U
#define PF5020_FAULT_COUNTER 0x41U
#define PF5020_FSAFE_COUNTER 0x42U
#define PF5020_FAULT_TIMERS  0x43U
#define PF5020_AMUX          0x44U

#define PF5020_SW_RAMP       0x46U
#define PF5020_SW1_CONFIG1   0x47U
#define PF5020_SW1_CONFIG2   0x48U
#define PF5020_SW1_PWRUP     0x49U
#define PF5020_SW1_MODE      0x4AU
#define PF5020_SW1_RUN_VOLT  0x4BU
#define PF5020_SW1_STBY_VOLT 0x4CU

#define PF5020_SW2_CONFIG1   0x4FU
#define PF5020_SW2_CONFIG2   0x50U
#define PF5020_SW2_PWRUP     0x51U
#define PF5020_SW2_MODE1     0x52U
#define PF5020_SW2_RUN_VOLT  0x53U
#define PF5020_SW2_STBY_VOLT 0x54U

#define PF5020_SWND1_CONFIG1  0x67U
#define PF5020_SWND1_CONFIG2  0x68U
#define PF5020_SWND1_PWRUP    0x69U
#define PF5020_SWND1_MODE1    0x6AU
#define PF5020_SWND1_RUN_VOLT 0x6BU

#define PF5020_LDO1_CONFIG1   0x6EU
#define PF5020_LDO1_CONFIG2   0x6FU
#define PF5020_LDO1_PWRUP     0x70U
#define PF5020_LDO1_RUN_VOLT  0x71U
#define PF5020_LDO1_STBY_VOLT 0x72U

#define PF5020_VSNVS_CONFIG1 0x75U

#define PF5020_PAGE_SELECT 0x77U

#define PF5020_INT_MASK_ARRAY                                                                            \
    {                                                                                                    \
        PF5020_INT_MASK1, PF5020_INT_MASK2, PF5020_SW_MODE_MASK, PF5020_SW_ILIM_MASK, PF5020_SW_UV_MASK, \
            PF5020_SW_OV_MASK, PF5020_PWRON_MASK                                                         \
    }
#define PF5020_INT_LATCH_ARRAY                                                                            \
    {                                                                                                     \
        PF5020_INT_STATUS1, PF5020_INT_STATUS2, PF5020_SW_MODE_INT, PF5020_SW_ILIM_INT, PF5020_SW_UV_INT, \
            PF5020_SW_OV_INT, PF5020_PWRON_INT                                                            \
    }

#define PF5020_SEQ_REG_ARRAY                                                                                \
    {                                                                                                       \
        PF5020_RESETBMCU_PWRUP, PF5020_PGOOD_PWRUP, PF5020_SW1_PWRUP, PF5020_SW2_PWRUP, PF5020_SWND1_PWRUP, \
            PF5020_LDO1_PWRUP                                                                               \
    }

/*!
 * @brief The enumeration of internal high speed clock frequency.
 */
typedef enum _pf5020_high_speed_clk_freq
{
    kPF5020_HighSpeedClkFreq20MHz = 0x0U, /*!< High speed clock frequency is 20MHz,
                                              switching regulator frequency is 2.5MHz. */
    kPF5020_HighSpeedClkFreq21MHz = 0x1U, /*!< High speed clock frequency is 21MHz,
                                              switching regulator frequency is 2.625MHz. */
    kPF5020_HighSpeedClkFreq22MHz = 0x2U, /*!< High speed clock frequency is 22MHz,
                                              switching regulator frequency is 2.750MHz. */
    kPF5020_HighSpeedClkFreq23MHz = 0x3U, /*!< High speed clock frequency is 23MHz,
                                              switching regulator frequency is 2.875MHz. */
    kPF5020_HighSpeedClkFreq24MHz = 0x4U, /*!< High speed clock frequency is 24MHz,
                                              switching regulator frequency is 3.0MHz. */
    kPF5020_HighSpeedClkFreq16MHz = 0x9U, /*!< High speed clock frequency is 16MHz,
                                              switching regulator frequency is 2.0MHz. */
    kPF5020_HighSpeedClkFreq17MHz = 0xAU, /*!< High speed clock frequency is 17MHz,
                                              switching regulator frequency is 2.125MHz. */
    kPF5020_HighSpeedClkFreq18MHz = 0xBU, /*!< High speed clock frequency is 18MHz,
                                              switching regulator frequency is 2.25MHz. */
    kPF5020_HighSpeedClkFreq19MHz = 0xCU, /*!< High speed clock frequency is 19MHz,
                                              switching regulator frequency is 2.375MHz. */
} pf5020_high_speed_clk_freq_t;

/*!
 * @brief The enumeration of internal high speed clock frequency range.
 *
 */
typedef enum _pf5020_high_speed_clk_ss_range
{
    kPF5020_HighSpeedClkSSRange0 = 0U, /*!< The maximum clock frequency range is +5%/-5%. */
    kPF5020_HighSpeedClkSSRange1 = 1U, /*!< The maximum clock frequency range is +10%/-10%.  */
} pf5020_high_speed_clk_ss_range_t;

/*!
 * @brief The enumeration of VSNVS LDO output voltage, 0 means turn off VSNVS LDO.
 */
typedef enum _pf5020_vsnvs_ldo_output_voltage
{
    kPF5020_VsnvsLdoOff = 0U,   /*!< Turn off VSNVS LDO. */
    kPF5020_VsnvsLdoOutput1P8V, /*!< Vsnvs LDO output 1.8V. */
    kPF5020_VsnsLdoOutput3P0V,  /*!< Vsnvs LDO output 3.0V. */
    kPF5020_VsnsLdoOutput3P3V,  /*!< Vsnvs LDO output 3.3V. */
} pf5020_vsnvs_ldo_output_voltage_t;

/*!
 * @brief The enumeration of PF5020 internal regulators.
 */
typedef enum _pf5020_regulator_name
{
    kPF5020_BuckRegulatorSw1   = 0x0U, /*!< Type1 Buck Regulator SW1. */
    kPF5020_BuckRegulatorSw2   = 0x1U, /*!< Type1 Buck Regulator SW2. */
    kPF5020_BuckRegulatorSwnd1 = 0x4U, /*!< Type2 Buck Regulator SWND1. */
    kPF5020_RegulatorLdo1      = 0x5U, /*!< Linear Regulator LDO1. */
} pf5020_regulator_name_t;

/*!
 * @brief The power down ramp and DVS rate during system on of type1 buck regulator.
 */
typedef enum _pf5020_type1_buck_regulator_dvs_ramp
{
    kPF5020_DVSRamp0 = 0x0U, /*!< Type1 Buck regulator DVS ramp0. */
    kPF5020_DVSRamp1 = 0x1U, /*!< Type1 Buck regulator DVS ramp1. */
    kPF5020_DVSRamp2 = 0x2U, /*!< Type1 Buck regulator DVS ramp2. */
    kPF5020_DVSRamp3 = 0x3U, /*!< Type1 Buck regulator DVS ramp3. */
} pf5020_type1_buck_regulator_dvs_ramp_t;

/*!
 * @brief The enumeration of all buck regulators'(SW1, SW2, SWND1) operate modes.
 */
typedef enum _pf5020_buck_regulator_operate_mode
{
    kPF5020_BuckRegulatorOff = 0x0U,   /*!< Turn off buck regulator. */
    kPF5020_BuckRegulatorPWMMode,      /*!< Set buck regulator as PWM mode. */
    kPF5020_BuckRegulatorPFMMode,      /*!< Set buck regulator as PFM mode. */
    kPF5020_BuckRegulatorAutoSkipMode, /*!< Set buck regulator as Auto skip mode. */
} pf5020_buck_regulator_operate_mode_t;

/*!
 * @brief The enumeration of all buck regulators'(SW1, SW2, SWND1) phase shift values.
 */
typedef enum _pf5020_buck_regulator_phase_shift
{
    kPF5020_BuckRegulatorPhaseShift45  = 0x0U, /*!< Phase shift 45 degrees. */
    kPF5020_BuckRegulatorPhaseShift90  = 0x1U, /*!< Phase shift 90 degrees. */
    kPF5020_BuckRegulatorPhaseShift135 = 0x2U, /*!< Phase shift 135 degrees. */
    kPF5020_BuckRegulatorPhaseShift180 = 0x3U, /*!< Phase shift 180 degrees. */
    kPF5020_BuckRegulatorPhaseShift225 = 0x4U, /*!< Phase shift 225 degrees. */
    kPF5020_BuckRegulatorPhaseShift270 = 0x5U, /*!< Phase shift 270 degrees. */
    kPF5020_BuckRegulatorPhaseShift315 = 0x6U, /*!< Phase shift 315 degrees. */
    kPF5020_BuckRegulatorPhaseShift0   = 0x7U, /*!< Phase shift 0 degrees. */
} pf5020_buck_regulator_phase_shift_t;

/*!
 * @brief The enumeration of all buck regulators'(SW1, SW2, SWND1) current limitation value.
 */
typedef enum _pf5020_buck_regulator_current_limit
{
    kPF5020_BuckRegulatorCurrentLimitBypass = 0x4U, /*!< Current limit fault bypassed. */
    kPF5020_BuckRegulatorCurrentLimit0      = 0x0U, /*!< Current limit protection enabled and current limit is 2.1A. */
    kPF5020_BuckRegulatorCurrentLimit1      = 0x1U, /*!< Current limit protection enabled and current limit is 2.6A. */
    kPF5020_BuckRegulatorCurrentLimit2      = 0x2U, /*!< Current limit protection enabled and current limit is 3.0A. */
    kPF5020_BuckRegulatorCurrentLimit3      = 0x3U, /*!< Current limit protection enabled and current limit is 4.5A. */
} pf5020_buck_regulator_current_limit_t;

/*!
 * @brief The enumeration of SWND1 buck regulator output voltage.
 */
typedef enum _pf5020_swnd1_output_voltage
{
    kPF5020_Swnd1Output1V = 0x0U, /*!< SWND1 output 1.0V during run state and standby state. */
    kPF5020_Swnd1Output1P1V,      /*!< SWND1 output 1.1V during run state and standby state. */
    kPF5020_Swnd1Output1P2V,      /*!< SWND1 output 1.2V during run state and standby state. */
    kPF5020_Swnd1Output1P25V,     /*!< SWND1 output 1.25V during run state and standby state. */
    kPF5020_Swnd1Output1P3V,      /*!< SWND1 output 1.3V during run state and standby state. */
    kPF5020_Swnd1Output1P35V,     /*!< SWND1 output 1.35V during run state and standby state. */
    kPF5020_Swnd1Output1P5V,      /*!< SWND1 output 1.5V during run state and standby state. */
    kPF5020_Swnd1Output1P6V,      /*!< SWND1 output 1.6V during run state and standby state. */
    kPF5020_Swnd1Output1P8V,      /*!< SWND1 output 1.8V during run state and standby state. */
    kPF5020_Swnd1Output1P85V,     /*!< SWND1 output 1.85V during run state and standby state. */

    kPF5020_Swnd1Output2P0V,      /*!< SWND1 output 2.0V during run state and standby state. */
    kPF5020_Swnd1Output2P1V,      /*!< SWND1 output 2.1V during run state and standby state. */
    kPF5020_Swnd1Output2P15V,     /*!< SWND1 output 2.15V during run state and standby state. */
    kPF5020_Swnd1Output2P25V,     /*!< SWND1 output 2.25V during run state and standby state. */
    kPF5020_Swnd1Output2P3V,      /*!< SWND1 output 2.3V during run state and standby state. */
    kPF5020_Swnd1Output2P4V,      /*!< SWND1 output 2.4V during run state and standby state. */
    kPF5020_Swnd1Output2P5V,      /*!< SWND1 output 2.5V during run state and standby state. */
    kPF5020_Swnd1Output2P8V,      /*!< SWND1 output 2.8V during run state and standby state. */

    kPF5020_Swnd1Output3P15V,     /*!< SWND1 output 3.15V during run state and standby state. */
    kPF5020_Swnd1Output3P20V,     /*!< SWND1 output 3.20V during run state and standby state. */
    kPF5020_Swnd1Output3P25V,     /*!< SWND1 output 3.25V during run state and standby state. */
    kPF5020_Swnd1Output3P30V,     /*!< SWND1 output 3.30V during run state and standby state. */
    kPF5020_Swnd1Output3P35V,     /*!< SWND1 output 3.3V during run state and standby state. */
    kPF5020_Swnd1Output3P40V,     /*!< SWND1 output 3.40V during run state and standby state. */
    kPF5020_Swnd1Output3P50V,     /*!< SWND1 output 3.50V during run state and standby state. */
    kPF5020_Swnd1Output3P80V,     /*!< SWND1 output 3.80V during run state and standby state. */

    kPF5020_Swnd1Output4P0V,      /*!< SWND1 output 4.0V during run state and standby state. */
    kPF5020_Swnd1Output4P1V,      /*!< SWND1 output 4.1V during run state and standby state. */
} pf5020_swnd1_output_voltage_t;

/*!
 * @brief The enumeration of LDO1 output voltage.
 */
typedef enum _pf5020_ldo1_output_voltage
{
    kPF5020_Ldo1Output1P5V = 0x0U, /*!< LDO1 output 1.5V. */
    kPF5020_Ldo1Output1P6V,        /*!< LDO1 output 1.6V */
    kPF5020_Ldo1Output1P8V,        /*!< LDO1 output 1.8V */
    kPF5020_Ldo1Output1P85V,       /*!< LDO1 output 1.85V */
    kPF5020_Ldo1Output2P15V,       /*!< LDO1 output 2.15V */
    kPF5020_Ldo1Output2P5V,        /*!< LDO1 output 2.5V */
    kPF5020_Ldo1Output2P8V,        /*!< LDO1 output 2.8V */
    kPF5020_Ldo1Output3P0V,        /*!< LDO1 output 3.0V */
    kPF5020_Ldo1Output3P1V,        /*!< LDO1 output 3.1V */
    kPF5020_Ldo1Output3P15V,       /*!< LDO1 output 3.15V */
    kPF5020_Ldo1Output3P2V,        /*!< LDO1 output 3.2V */
    kPF5020_Ldo1Output3P3V,        /*!< LDO1 output 3.3V */
    kPF5020_Ldo1Output3P35V,       /*!< LDO1 output 3.35V */
    kPF5020_Ldo1Output4P0V,        /*!< LDO1 output 4.0V */
    kPF5020_Ldo1Output4P9V,        /*!< LDO1 output 4.9V */
    kPF5020_Ldo1Output5P0V,        /*!< LDO1 output 5.0V */
} pf5020_ldo1_output_voltage_t;

/*!
 * @brief The enumeration of UV debounce time.
 */
typedef enum _pf5020_uv_debounce_time
{
    kPF5020_UVDebounceTime5us = 0x0U, /*!< UV debounce time will be set as 5us. */
    kPF5020_UVDebounceTime15us,       /*!< UV debounce time will be set as 15us. */
    kPF5020_UVDebounceTime30us,       /*!< UV debounce time will be set as 30us. */
    kPF5020_UVDebounceTime40us,       /*!< UV debounce time will be set as 40us. */
} pf5020_uv_debounce_time_t;

/*!
 * @brief The enumeration of OV debounce time.
 */
typedef enum _pf5020_ov_debounce_time
{
    kPF5020_OVDebounceTime30us = 0x0U, /*!< OV debounce time will be set as 30us. */
    kPF5020_OVDebounceTime50us,        /*!< OV debounce time will be set as 50us. */
    kPF5020_OVDebounceTime80us,        /*!< OV debounce time will be set as 80us. */
    kPF5020_OVDebounceTime125us,       /*!< OV debounce time will be set as 125us. */
} pf5020_ov_debounce_time_t;

/*!
 * @brief The enumeration of different reset behaviors triggered by WDI pin.
 */
typedef enum _pf5020_wdi_mode
{
    kPF5020_WDIPerformSoftWDReset = 0U, /*!< A WDI pin assert performs a hard WD reset. */
    kPF5020_WDIPerformHardWDReset = 1U, /*!< A WDI pin assert performs a soft WD reset.  */
} pf5020_wdi_mode_t;

/*!
 * @brief The enumeration of temperature sensor's operate mode.
 */
typedef enum _pf5020_temp_sensor_operate_mode
{
    kPF5020_TempSensorSampleMode = 0U,   /*!< Temperature sensor operates in sampling mode to
                                               reduce current consumption. */
    kPF5020_TempSensorAlwaysOnMode = 1U, /*!<  Temperatue sensor operates in Always on mode. */
} pf5020_temp_sensor_operate_mode_t;

/*!
 * @brief The enumeration of AMUX selection.
 */
typedef enum _pf5020_amux_selection
{
    kPF5020_AmuxSelDisable = 0x0U, /*!< AMUX selection disabled, internal signal dividing ratio N/A. */
    kPF5020_AmuxSelTempIc  = 0x7U, /*!< AMUX selection TEMP_IC, internal signal dividing ratio 1. */
} pf5020_amux_selection_t;

/*!
 * @brief The enumeration of interupts that PF5020 support, the member of this enumeration can be used to enable/disable
 * interrupts or get interrupt status flags.
 */
typedef enum _pf5020_interrupts
{
    kPF5020_IntStatus1_VinOVLOInterrupt = 0x1ULL,  /*!< Used to enable/disable Int Status1 Vin OVLO interrupt. */
    kPF5020_IntStatus1_PgoodInterrupt   = 0x2ULL,  /*!< Used to enable/disable Int Status1 PGOOD interrupt. */
    kPF5020_IntStatus1_PwrdnInterrupt   = 0x8ULL,  /*!< Used to enable/disable Int Status1 PWRDN interrupt. */
    kPF5020_IntStatus1_PwrupInterrupt   = 0x10ULL, /*!< Used to enable/disable Int Status1 PWRUP interrupt. */
    kPF5020_IntStatus1_CrcInterrupt     = 0x20ULL, /*!< Used to enable/disable Int Status1 CRC interrupt. */
    kPF5020_IntStatus1_FreqRdyInterrupt = 0x40ULL, /*!< Used to enable/disable Int Status1 frequency ready interrupt. */
    kPF5020_IntStatus1_SdwnInterrupt    = 0x80ULL, /*!< Used to enable/disable Int Status1 SDWN interrupt. */

    kPF5020_IntStatus2_Therm80Interrupt = (0x1ULL << 8ULL),   /*!< Used to enable/disable Int
                                                                  Status2 therm 80 interrupt. */
    kPF5020_IntStatus2_Therm95Interrupt = (0x2ULL << 8ULL),   /*!< Used to enable/disable Int
                                                                  Status2 therm 95 interrupt. */
    kPF5020_IntStatus2_Therm110Interrupt = (0x4ULL << 8ULL),  /*!< Used to enable/disable Int
                                                                 Status2 therm 110 interrupt. */
    kPF5020_IntStatus2_Therm125Interrupt = (0x8ULL << 8ULL),  /*!< Used to enable/disable Int
                                                                 Status2 therm 125 interrupt. */
    kPF5020_IntStatus2_Therm140Interrupt = (0x10ULL << 8ULL), /*!< Used to enable/disable Int
                                                                Status2 therm 140 interrupt. */
    kPF5020_IntStatus2_Therm155Interrupt = (0x20ULL << 8ULL), /*!< Used to enable/disable Int
                                                                Status2 therm 155 interrupt. */
    kPF5020_IntStatus2_FsyncFltInterrupt = (0x40ULL << 8ULL), /*!< Used to enable/disable Int
                                                                Status2 Fsync filter interrupt. */
    kPF5020_IntStatus2_WdiInterrupt = (0x80ULL << 8ULL),      /*!< Used to enable/disable Int Status2 WDI interrupt. */

    kPF5020_SwMode_Sw1ModeInterrupt   = (0x1ULL << 16ULL),    /*!< Used to enable/disable SW1 mode interrupt. */
    kPF5020_SwMode_Sw2ModeInterrupt   = (0x2ULL << 16ULL),    /*!< Used to enable/disable SW2 interrupt. */
    kPF5020_SwMode_Swnd1ModeInterrupt = (0x40ULL << 16ULL),   /*!< Used to enable/disable SWND1 interrupt. */

    kPF5020_ILIM_Sw1IlimInterrupt   = (0x1ULL << 24ULL),      /*!< Used to enable/disable SW1 ILIM interrupt. */
    kPF5020_ILIM_Sw2IlimInterrupt   = (0x2ULL << 24ULL),      /*!< Used to enable/disable SW2 ILIM interrupt. */
    kPF5020_ILIM_Swnd1IlimInterrupt = (0x40ULL << 24ULL),     /*!< Used to enable/disable SWND1 ILIM interrupt. */

    kPF5020_ILIM_Ldo1IlimInterrupt = (0x80ULL << 24ULL),      /*!< Used to enable/disable LDO1 ILIM interrupt. */

    kPF5020_UV_Sw1UvInterrupt   = (0x1ULL << 32ULL),          /*!< Used to enable/disable SW1 UV interrupt. */
    kPF5020_UV_Sw2UvInterrupt   = (0x2ULL << 32ULL),          /*!< Used to enable/disable SW2 UV interrupt. */
    kPF5020_UV_Swnd1UvInterrupt = (0x40ULL << 32ULL),         /*!< Used to enable/disable SWND1 UV interrupt. */

    kPF5020_UV_Ldo1UvInterrupt = (0x80ULL << 32ULL),          /*!< Used to enable/disable SW1 LDO1 interrupt. */

    kPF5020_OV_Sw1OvInterrupt   = (0x1ULL << 40ULL),          /*!< Used to enable/disable SW1 OV interrupt. */
    kPF5020_OV_Sw2OvInterrupt   = (0x2ULL << 40ULL),          /*!< Used to enable/disable SW2 OV interrupt. */
    kPF5020_OV_Swnd1OvInterrupt = (0x40ULL << 40ULL),         /*!< Used to enable/disable SWND1 OV interrupt. */

