solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.h
    kPF5020_OV_Ldo1OvInterrupt = (0x80ULL << 40ULL),          /*!< Used to enable/disable LDO1 OV interrupt. */

    kPF5020_Pwron_PushInterrupt  = (0x1ULL << 48ULL),         /*!< Used to enable/disable PWRON Push interrupt. */
    kPF5020_Pwron_RelInterrupt   = (0x2ULL << 48ULL),         /*!< Used to enable/disable PWRON REL interrupt. */
    kPF5020_Pwron_1sInterrupt    = (0x4ULL << 48ULL),         /*!< Used to enable/disable PWRON 1s interrupt. */
    kPF5020_Pwron_2sInterrupt    = (0x8ULL << 48ULL),         /*!< Used to enable/disable PWRON 2s interrupt. */
    kPF5020_Pwron_3sInterrupt    = (0x10ULL << 48ULL),        /*!< Used to enable/disable PWRON 3s interrupt. */
    kPF5020_Pwron_4sInterrupt    = (0x20ULL << 48ULL),        /*!< Used to enable/disable PWRON 4s interrupt. */
    kPF5020_Pwron_8sInterrupt    = (0x40ULL << 48ULL),        /*!< Used to enable/disable PWRON 8s interrupt. */
    kPF5020_Pwron_BgmonInterrupt = (0x80ULL << 48ULL),        /*!< Used to enable/disable PWRON BGMON interrupt. */

    kPF5020_AllInterrupts = 0xFFC3C3C343FFFBULL,              /*!< All interrupts. */
} pf5020_interrupt_t;

/*!
 * @brief The enumeration of sequence time base.
 */
typedef enum _pf5020_sequencer_time_base
{
    kPF5020_TimeBase30us  = 0x0U, /*!< Sequencer time base is 30us. */
    kPF5020_TimeBase120us = 0x1U, /*!< Sequencer time base is 120us. */
    kPF5020_TimeBase250us = 0x2U, /*!< Sequencer time base is 250us. */
    kPF5020_TimeBase500us = 0x3U, /*!< Sequencer time base is 500us. */
} pf5020_sequencer_time_base_t;

/*!
 * @brief The enumeration of power down mode, including sequential mode and group mode.
 */
typedef enum _pf5020_power_down_mode
{
    kPF5020_PowerDownSequentialMode = 0U, /*!< Use the same sequence slot value as the power up sequence to power
                                              down in reverse order. */
    kPF5020_PowerDownGroupMode = 1U,      /*!< Power down in groups, all regulators assigned to the same group are
                                              disabled at the same time when the corresponding group is due to be
                                              disabled. */
} pf5020_power_down_mode_t;

/*!
 * @brief The enumeration of power down group, group 4 being the lowest hierarchy and
 * group 1 the highest hierarchy group.
 */
typedef enum _pf5020_power_down_group
{
    kPF5020_PowerDownGroup4 = 0x0U, /*!< Power down group4. */
    kPF5020_PowerDownGroup3,        /*!< Power down group3. */
    kPF5020_PowerDownGroup2,        /*!< Power down group2. */
    kPF5020_PowerDownGroup1,        /*!< Power down group1. */
} pf5020_power_down_group_t;

/*!
 * @brief The enumeration of power down delay.
 */
typedef enum _pf5020_power_down_delay
{
    kPF5020_PowerDownDelay120us  = 0x0, /*!< Power down delay 120us. */
    kPF5020_PowerDownDelay250us  = 0x1, /*!< Power down delay 250us. */
    kPF5020_PowerDownDelay500us  = 0x2, /*!< Power down delay 500us. */
    kPF5020_PowerDownDelay1000us = 0x3, /*!< Power down delay 1000us. */
} pf5020_power_down_delay_t;

/*!
 * @brief The enumeration of delay after RESETBMCU is asserted.
 */
typedef enum _pf5020_resetBMCU_delay
{
    kPF5020_ResetBMcuDelayOff = 0x0U, /*!< RESETBMCU no delay. */
    kPF5020_ResetBMcuDelay10us,       /*!< RESETBMCU delay 10 us. */
    kPF5020_ResetBMcuDelay100us,      /*!< RESETBMCU delay 100 us. */
    kPF5020_ResetBMcuDelay500us,      /*!< RESETBMCU delay 500 us. */
} pf5020_resetBMCU_delay_t;

/*!
 * @brief Internal high speed clock configuration.
 */
typedef struct _pf5020_high_speed_clk_config
{
    pf5020_high_speed_clk_freq_t clkFreq;     /*!< The frequency of internal high speed clock,
                                                  please refer to @ref pf5020_high_speed_clk_freq_t for details. */
    bool enableSS;                            /*!< Enable/disable spread-spectrum,
                                                  - \b true Enable spread-spectrum;
                                                  - \b false Disable spread-spectrum. */
    pf5020_high_speed_clk_ss_range_t ssRange; /*!< The range of internal high speed clock,
                                                  please refer to @ref pf5020_high_speed_clk_ss_range_t. */
} pf5020_high_speed_clk_config_t;

/*!
 * @brief Type1 buck regulator SW1 global configuration, including run/standby operate mode, run/standby voltage value.
 */
typedef struct _pf5020_sw1_regulator_config
{
    pf5020_type1_buck_regulator_dvs_ramp_t sw1DvsRamp; /*!< SW1 DVS Ramp, please refer to
                                                           @ref pf5020_type1_buck_regulator_dvs_ramp_t
                                                           for details. */

    uint8_t sw1RunOutputVolt;                          /*!< The output voltage during RUN state, the step is 6.25mV,
                                                        0: 0.4V, 177: 1.8V, 178 to 255 reserved. */
    pf5020_buck_regulator_operate_mode_t sw1RunOperateMode; /*!< SW1 operate mode in run state, please refer to
                                                            @ref pf5020_buck_regulator_operate_mode_t for details. */

    uint8_t sw1StandbyOutputVolt; /*!< The output voltage during standby state, the step is 6.25mV,
                                   0: 0.4V, 177: 1.8V, 178 to 255 reserved. */
    pf5020_buck_regulator_operate_mode_t sw1StandbyOperateMode; /*!< SW1 operate mode in standby mode. */

    pf5020_buck_regulator_phase_shift_t sw1PhaseShift;          /*!< SW1 buck regulator phase shift value, please refer
                                                                    to @ref pf5020_buck_regulator_phase_shift_t for details. */

    pf5020_buck_regulator_current_limit_t sw1CurrentLimit;      /*!< SW1 buck regulator current limitation value, please
                                                                    refer to @ref pf5020_buck_regulator_current_limit_t
                                                                    for details. */
    bool sw1EnableUVBypass;                                     /*!< Used to control whether bypass UV monitor for SW1,
                                                                    - \b true Bypass UV monitor for SW1.
                                                                    - \b false Don't bypass UV monitor for SW1. */
    bool sw1EnableOVBypass;                                     /*!< Used to control whether bypass OV monitor for SW1,
                                                                    - \b true Bypass OV monitor for SW1.
                                                                    - \b false Don't bypass OV monitor for SW1. */
    bool sw1FaultReEnabled;       /*!< Used to control whether return to sw1 regulator previous state
                                  if fault condition is cleared.
                                  - \b true  SW1 regulator remains disabled after the fault condition is cleared
                                              or no longer present.
                                  - \b false SW1 regulator returns to its previous state if fault condition is cleared. */

    bool sw1EnablePGMonitor;      /*!< Enable/disable SW1 regulator PG monitor. */

    bool sw1EnableWatchdogBypass; /*!< Enable/disable watchdog bypass,
                                      - \b true The watchdog bypass is enabled and the output of the SW1 regulator
                                                  is not affected by the soft WD reset, keeping its current
                                                  configuration.
                                      - \b false The watchdog bypass is disabled and the output of the SW1
                                                  regulator is returned to its default OTP value during the
                                                  soft WD reset. */
} pf5020_sw1_regulator_config_t;

/*!
 * @brief Type1 buck regulator SW2 global configuration, including run/standby operate mode, run/standby voltage value.
 */
typedef struct _pf5020_sw2_regulator_config
{
    pf5020_type1_buck_regulator_dvs_ramp_t sw2DvsRamp; /*!< SW2 DVS Ramp, please refer to
                                                           @ref pf5020_type1_buck_regulator_dvs_ramp_t
                                                           for details. */

