solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.h
    uint8_t sw2RunOutputVolt;                          /*!< The output voltage during RUN state, the step is 6.25mV,
                                                        0: 0.4V, 177: 1.8V, 178 to 255 reserved. */
    pf5020_buck_regulator_operate_mode_t
        sw2RunOperateMode;                             /*!< SW2 operate mode in run state, please refer to
                                                           @ref pf5020_buck_regulator_operate_mode_t for details. */

    uint8_t sw2StandbyOutputVolt;                      /*!< The output voltage during standby state, the step is 6.25mV,
                                                        0: 0.4V, 177: 1.8V, 178 to 255 reserved. */
    pf5020_buck_regulator_operate_mode_t sw2StandbyOperateMode; /*!< SW2 operate mode in standby mode. */

    pf5020_buck_regulator_phase_shift_t sw2PhaseShift;          /*!< SW2 buck regulator phase shift value, please refer
                                                                    to @ref pf5020_buck_regulator_phase_shift_t for details. */

    bool sw2EnableVTTOperation; /*!< Enable/disable VTT mode, VTT mode used to create VTT termination
                                    for DDR memories. */

    pf5020_buck_regulator_current_limit_t sw2CurrentLimit; /*!< SW2 buck regulator current limitation value, please
                                                                   refer to @ref pf5020_buck_regulator_current_limit_t
                                                                   for details. */
    bool sw2EnableUVBypass;                                /*!< Used to control whether bypass UV monitor for SW2,
                                                               - \b true Bypass UV monitor for SW2.
                                                               - \b false Don't bypass UV monitor for SW2. */
    bool sw2EnableOVBypass;                                /*!< Used to control whether bypass OV monitor for SW2,
                                                               - \b true Bypass OV monitor for SW2.
                                                               - \b false Don't bypass OV monitor for SW2. */
    bool sw2FaultReEnabled;       /*!< Used to control whether return to sw2 regulator previous state
                                      if fault condition is cleared.
                                  - \b true  SW2 regulator remains disabled after the fault condition is cleared
                                              or no longer present.
                                  - \b false SW2 regulator returns to its previous state if fault condition is cleared. */

    bool sw2EnablePGMonitor;      /*!< Enable/disable SW2 regulator PG monitor. */

    bool sw2EnableWatchdogBypass; /*!< Enable/disable watchdog bypass,
                                      - \b true The watchdog bypass is enabled and the output of the SW2 regulator
                                                  is not affected by the soft WD reset, keeping its current
                                                  configuration.
                                      - \b false The watchdog bypass is disabled and the output of the SW2
                                                  regulator is returned to its default OTP value during the
                                                  soft WD reset. */

} pf5020_sw2_regulator_config_t;

/*!
 * @brief Type2 buck regulator SWND1 global configuration, including run/standby operate mode, output voltage value.
 */
typedef struct _pf5020_swnd1_regulator_config
{
    pf5020_swnd1_output_voltage_t swnd1OutputVolt;                /*!< This member sets the output voltage during RUN
                                                                        and Standby state. */
    pf5020_buck_regulator_operate_mode_t swnd1RunOperateMode;     /*!< SWND1 operate mode in run state, please refer to
                                                                  @ref pf5020_buck_regulator_operate_mode_t for details. */
    pf5020_buck_regulator_operate_mode_t swnd1StandbyOperateMode; /*!< SWND1 operate mode in standby mode. */

    pf5020_buck_regulator_phase_shift_t swnd1PhaseShift;     /*!< SWND1 buck regulator phase shift value, please refer
                                                             to @ref pf5020_buck_regulator_phase_shift_t for details. */

    pf5020_buck_regulator_current_limit_t swnd1CurrentLimit; /*!< SWND1 buck regulator current limitation value, please
                                                                refer to @ref pf5020_buck_regulator_current_limit_t
                                                                for details. */
    bool swnd1EnableUVBypass;                                /*!< Used to control whether bypass UV monitor for SWND1,
                                                                 - \b true Bypass UV monitor for SWND1.
                                                                 - \b false Don't bypass UV monitor for SWND1. */
    bool swnd1EnableOVBypass;                                /*!< Used to control whether bypass OV monitor for SWND1,
                                                                 - \b true Bypass OV monitor for SWND1.
                                                                 - \b false Don't bypass OV monitor for SWND1. */
    bool swnd1FaultReEnabled;       /*!< Used to control whether return to swnd1 regulator previous state
                                      if fault condition is cleared.
                                  - \b true  SWND1 regulator remains disabled after the fault condition is cleared
                                              or no longer present.
                                  - \b false SWND1 regulator returns to its previous state if fault condition is cleared. */

    bool swnd1EnablePGMonitor;      /*!< Enable/disable SWND1 regulator PG monitor. */

    bool swnd1EnableWatchdogBypass; /*!< Enable/disable watchdog bypass,
                                      - \b true The watchdog bypass is enabled and the output of the SWND1 regulator
                                                  is not affected by the soft WD reset, keeping its current
                                                  configuration.
                                      - \b false The watchdog bypass is disabled and the output of the SWND1
                                                  regulator is returned to its default OTP value during the
                                                  soft WD reset. */
} pf5020_swnd1_regulator_config_t;

/*!
 * @brief Linear regulator LDO1 global configuration, including run/standby operate mode, output voltage value and so
 * on.
 */
typedef struct _pf5020_ldo1_regulator_config
{
    bool ldo1RunEnable;                                 /*!< Enable/disable LDO1 in run state,
                                                            - \b true Enable LDO1 in run state;
                                                            - \b false Disable LDO1 in run state. */
    pf5020_ldo1_output_voltage_t ldo1RunOutputVolt;     /*!< Used to set the output voltage of LDO1 in run state,
                                                            please refer to @ref pf5020_ldo1_output_voltage_t. */

