solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.h
    bool ldo1StandbyEnable;                             /*!< Enable/disable LDO1 in standby state,
                                                            - \b true Enable LDO1 in standby state;
                                                            - \b false Disable LDO1 in standby state. */
    pf5020_ldo1_output_voltage_t ldo1StandbyOutputVolt; /*!< Used to set the output voltage of LDO1 in standby state,
                                                        please refer to @ref pf5020_ldo1_output_voltage_t. */

    bool ldo1EnableUVBypass;                            /*!< Used to control whether bypass UV monitor for LDO1,
                                                            - \b true Bypass UV monitor for LDO1.
                                                            - \b false Don't bypass UV monitor for LDO1. */
    bool ldo1EnableOVBypass;                            /*!< Used to control whether bypass OV monitor for LDO1,
                                                            - \b true Bypass OV monitor for LDO1.
                                                            - \b false Don't bypass OV monitor for LDO1. */
    bool ldo1EnableILIMBypass;                          /*!< Used to control whether bypass ILIM monitor for LDO1,
                                                            - \b true Bypass ILIM monitor for LDO1.
                                                            - \b false Don't bypass ILIM monitor for LDO1. */

    bool ldo1FaultReEnabled;       /*!< Used to control whether return to ldo1 regulator previous state
                                      if fault condition is cleared.
                                  - \b true  LDO1 regulator remains disabled after the fault condition is cleared
                                              or no longer present.
                                  - \b false LDO1 regulator returns to its previous state if fault condition is
                                              cleared. */

    bool ldo1EnablePGMonitor;      /*!< Enable/disable LDO1 regulator PG monitor. */

    bool ldo1EnableWatchdogBypass; /*!< Enable/disable watchdog bypass,
                                      - \b true The watchdog bypass is enabled and the output of the LDO1 regulator
                                                  is not affected by the soft WD reset, keeping its current
                                                  configuration.
                                      - \b false The watchdog bypass is disabled and the output of the LDO1
                                                  regulator is returned to its default OTP value during the
                                                  soft WD reset. */
} pf5020_ldo1_regulator_config;

/*!
 * @brief Internal watchdog timer configuration, including timer duration, cyclic counter max value and so on.
 */
typedef struct _pf5020_wdog_internal_timer_config
{
    bool enable;                  /*!< Enable/disable the internal watchdog timer operation. */
    bool enableStandby;           /*!< Enable/disable the internal watchdog timer operation during standby. */
    uint8_t timerDuration;        /*!< The internal watchdog timer expire duration value, ranges from 0 to 15,
                                       the actual expire time = 2 ^ timerDuration.  */
    uint8_t cyclicCounterMaxVale; /*!< The max value of watchdog cyclic counter, and the cyclic counter is used
                                         to ensure no cyclic watchdog condition occurs. */
} pf5020_wdog_internal_timer_config_t;

/*!
 * @brief PF5020 power up sequence configuration.
 */
typedef struct _pf5020_power_up_sequence
{
    uint8_t resetBMCUSeq; /*!< The sequence slot of RESETBMCU pin in power up sequence, sequence code 0 indicates that
                              the RESETBMCU is not part of the power up sequence. */
    uint8_t pGoodSeq;     /*!< The sequence slot of PGOOD pin in power up sequence, sequence code 0 indicates that
                              the PGOOD is not part of the power up sequence. */
    uint8_t sw1Seq;       /*!< The sequence slot of SW1 regulator in power up sequence, sequence code 0 indicates that
                              the SW1 regulator is not part of the power up sequence. */
    uint8_t sw2Seq;       /*!< The sequence slot of SW2 regulator in power up sequence, sequence code 0 indicates that
                              the SW2 regulator is not part of the power up sequence. */
    uint8_t swnd1Seq;     /*!< The sequence slot of SWND1 regulator in power up sequence, sequence code 0 indicates that
                              the SWND1 regulator is not part of the power up sequence. */
    uint8_t ldo1Seq;      /*!< The sequence slot of LDO in power up sequence, sequence code 0 indicates that
                              the LDO is not part of the power up sequence. */
} pf5020_power_up_sequence_t;

/*!
 * @brief PF5020 power down group configuration.
 */
typedef struct _pf5020_power_down_group_config
{
    pf5020_power_down_group_t resetBMCUGroup; /*!< The power down group of RESETBMCU pin. */
    pf5020_power_down_group_t pGoodGroup;     /*!< The power down group of PGOOD pin. */
    pf5020_power_down_group_t sw1Group;       /*!< The power down group of SW1 regulator. */
    pf5020_power_down_group_t sw2Group;       /*!< The power down group of SW2 regulator. */
    pf5020_power_down_group_t swnd1Group;     /*!< The power down group of SWND1 regulator. */
    pf5020_power_down_group_t ldo1Group;      /*!< The power down group of LDO1. */
} pf5020_power_down_group_config_t;

/*!
 * @brief PF5020 runtime handle, including send function, receive function and slave address.
 */
typedef struct _pf5020_handle
{
    status_t (*I2C_SendFunc)(uint8_t deviceAddress,
                             uint32_t subAddress,
                             uint8_t subAddressSize,
                             uint8_t *txBuff,
                             uint8_t txBuffSize); /*!< Pointer to I2C send function. */
    status_t (*I2C_ReceiveFunc)(uint8_t deviceAddress,
                                uint32_t subAddress,
                                uint8_t subAddressSize,
                                uint8_t *rxBuff,
                                uint8_t rxBuffSize); /*!< Pointer to I2C receive function. */
    uint8_t slaveAddress;                            /*!< device slave address. */
} pf5020_handle_t;

/*!
 * @brief PF5020 initialize configuration.
 */
typedef struct _pf5020_config
{
    status_t (*I2C_SendFunc)(uint8_t deviceAddress,
                             uint32_t subAddress,
                             uint8_t subAddressSize,
                             uint8_t *txBuff,
                             uint8_t txBuffSize); /*!< Pointer to I2C send function. */
    status_t (*I2C_ReceiveFunc)(uint8_t deviceAddress,
                                uint32_t subAddress,
                                uint8_t subAddressSize,
                                uint8_t *rxBuff,
                                uint8_t rxBuffSize); /*!< Pointer to I2C receive function. */
    uint8_t slaveAddress;                            /*!< device slave address. */
} pf5020_config_t;

