solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.h
/*******************************************************************************
 * API
 ******************************************************************************/

/*! @name Basic Interfaces
 * @{
 */

/*!
 * @brief Write to PF5020 register via I2C.
 *
 * @param handle The pointer to @ref pf5020_handle_t.
 * @param regAddr The address of register to write.
 * @param val The value to be write.
 *
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WriteReg(pf5020_handle_t *handle, uint8_t regAddr, uint8_t val);

/*!
 * @brief Read value from PF5020 register via I2C.
 *
 * @param handle The pointer to @ref pf5020_handle_t.
 * @param regAddr The address of register to write.
 * @param val Pointer store return value.
 *
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_ReadReg(pf5020_handle_t *handle, uint8_t regAddr, uint8_t *val);

/*!
 * @brief Read and modify the register value
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param regAddr The address of register.
 * @param mask The mask of register bit to be modified.
 * @param val The value to be set.
 *
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_ModifyReg(pf5020_handle_t *handle, uint8_t regAddr, uint8_t mask, uint8_t val);

/*!
 * @brief Dump the value of continuous registers.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param regAddr The address of start register.
 * @param buffer The buffer to store the dumped registers' value.
 * @param length The length of the continuous registers to be dumped.
 *
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_DumpReg(pf5020_handle_t *handle, uint8_t regAddr, uint8_t *buffer, uint8_t length);

/*!
 * @brief Get default initialize configuration.
 *
 * @code
 *   config->I2C_SendFunc = NULL;
 *   config->I2C_ReceiveFunc = NULL;
 *   config->slaveAddress = 0x08U;
 * @endcode
 * @param config The pointer to @ref pf5020_config_t structure.
 */
void PF5020_GetDefaultConfig(pf5020_config_t *config);

/*!
 * @brief Initialize runtime handle.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param config The pointer to @ref pf5020_config_t structure.
 */
void PF5020_CreateHandle(pf5020_handle_t *handle, const pf5020_config_t *config);

/*! @} */

/*! @name Power Up/Down Sequence Control API
 *@{
 */

/*!
 * @brief Set power up sequencer time base.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param timeBase The time base value to set, please refer @ref pf5020_sequencer_time_base_t for details.
 *
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetSequencerTimeBase(pf5020_handle_t *handle, pf5020_sequencer_time_base_t timeBase);

/*!
 * @brief Set power up sequence, when transitioning from standby state to run state, the power up sequencer is activated
 * only if any of the regulators is re-enabled during this transition.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param powerUpSeq The pointer to @ref pf5020_power_up_sequence_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetPowerUpSequence(pf5020_handle_t *handle, pf5020_power_up_sequence_t *powerUpSeq);

/*!
 * @brief Turn off PF5020 PMIC.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_TurnOffPMIC(pf5020_handle_t *handle);

/*!
 * @brief Set power down mode, sequential mode or group mode.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param powerDownMode The power down mode to set, please refer to @ref pf5020_power_down_mode_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetPowerDownMode(pf5020_handle_t *handle, pf5020_power_down_mode_t powerDownMode);

/*!
 * @brief Set power down groups that each internal module placed to.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param groupConfig Pointer to the @ref pf5020_power_down_group_config_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetPowerDownGroups(pf5020_handle_t *handle, const pf5020_power_down_group_config_t *groupConfig);

/*!
 * @brief Set selected power down group's delay.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param group The selected power down group, please refer to @ref pf5020_power_down_group_t for details.
 * @param delay The delay value to be set, please refer to @ref pf5020_power_down_delay_t for details.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetPowerDownGroupDelay(pf5020_handle_t *handle,
                                       pf5020_power_down_group_t group,
                                       pf5020_power_down_delay_t delay);

/*!
 * @brief Set delay to disable the regulators after RESETBMCU is asserted.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param delay The delay value, please refer to @ref pf5020_resetBMCU_delay_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetResetBMcuPinDelay(pf5020_handle_t *handle, pf5020_resetBMCU_delay_t delay);

/*! @} */

/*! @name Clock Management
 *@{
 */

/*!
 * @brief Configure internal high speed clock.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param config The pointer to @ref pf5020_high_speed_clk_config_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_CLK_ConfigHighSpeedClock(pf5020_handle_t *handle, const pf5020_high_speed_clk_config_t *config);

/*!
 * @brief Enable/disable clock sync out.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Used to enable/disable sync output.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_CLK_EnableSyncOut(pf5020_handle_t *handle, bool enable);

/*! @} */

/*! @name Converters Management
 * @{
 */

/*!
 * @brief Set VSNS LDO output voltage.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param voltage The output voltage of VSNVS, please refer to @ref pf5020_vsnvs_ldo_output_voltage_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetVsnvsLdoOutputVoltage(pf5020_handle_t *handle, pf5020_vsnvs_ldo_output_voltage_t voltage);

/* SW1 Buck Regulator Control APIs. */
/*!
 * @brief Set SW1 Buck regulator global configuration.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param config The pointer to @ref pf5020_sw1_regulator_config_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetGlobalConfig(pf5020_handle_t *handle, const pf5020_sw1_regulator_config_t *config);

/*!
 * @brief Set DVS Ramp for SW1 buck regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param dvsRamp The DVS ramp value to set, please refer to @ref pf5020_type1_buck_regulator_dvs_ramp_t for details.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetDvsRamp(pf5020_handle_t *handle, pf5020_type1_buck_regulator_dvs_ramp_t dvsRamp);

/*!
 * @brief Set SW1 regulator's output voltage and operate mode in run state.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param runOutputVolt The output voltage of SW1 in run state.
 * @param runOperateMode The operate mode of SW1 in run state.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetRunStateOption(pf5020_handle_t *handle,
                                      uint8_t runOutputVolt,
                                      pf5020_buck_regulator_operate_mode_t runOperateMode);

/*!
 * @brief Set SW1 regulator's output voltage and operate mode in standby state.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param standbyOutputVolt The output voltage of SW1 in standby state.
 * @param standbyOperateMode The operate mode of SW1 in standby state.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetStandbyStateOption(pf5020_handle_t *handle,
                                          uint8_t standbyOutputVolt,
                                          pf5020_buck_regulator_operate_mode_t standbyOperateMode);

/*!
 * @brief Set SW1 regulator fault detection related options.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param currentLimit SW1 buck regulator current limitation value, please refer to
 *                      @ref pf5020_buck_regulator_current_limit_t for details.
 * @param enableUVBypass Enable/disable UV bypass.
 * @param enableOVBypass Enable/disable OV bypass.
 * @param faultReEnabled Used to control whether return to sw1 regulator previous state if fault condition is cleared.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetFaultDetection(pf5020_handle_t *handle,
                                      pf5020_buck_regulator_current_limit_t currentLimit,
                                      bool enableUVBypass,
                                      bool enableOVBypass,
                                      bool faultReEnabled);

/*!
 * @brief Set SW1 regulator phase shift value.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param phaseShift SW1 buck regulator phase shift value, please refer to @ref pf5020_buck_regulator_phase_shift_t
 *                   for details.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetPhaseShift(pf5020_handle_t *handle, pf5020_buck_regulator_phase_shift_t phaseShift);

/*!
 * @brief Enable/disable PG monitor for SW1 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable PG monitor.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_EnablePGMonitor(pf5020_handle_t *handle, bool enable);

/*!
 * @brief Enable/disable watchdog bypass for SW1 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable watchdog bypass.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_EnableWatchDogBypass(pf5020_handle_t *handle, bool enable);

/* SW2 Buck Regulator Control APIs. */
/*!
 * @brief Set SW2 Buck regulator global configuration.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param config The pointer to @ref pf5020_sw2_regulator_config_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetGlobalConfig(pf5020_handle_t *handle, const pf5020_sw2_regulator_config_t *config);

/*!
 * @brief Set DVS Ramp for SW2 buck regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param dvsRamp The DVS ramp value to set, please refer to @ref pf5020_type1_buck_regulator_dvs_ramp_t for details.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetDvsRamp(pf5020_handle_t *handle, pf5020_type1_buck_regulator_dvs_ramp_t dvsRamp);

/*!
 * @brief Set SW2 regulator's output voltage and operate mode in run state.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param runOutputVolt The output voltage of SW2 in run state.
 * @param runOperateMode The operate mode of SW2 in run state.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetRunStateOption(pf5020_handle_t *handle,
                                      uint8_t runOutputVolt,
                                      pf5020_buck_regulator_operate_mode_t runOperateMode);

/*!
 * @brief Set SW2 regulator's output voltage and operate mode in standby state.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param standbyOutputVolt The output voltage of SW2 in standby state.
 * @param standbyOperateMode The operate mode of SW2 in standby state.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetStandbyStateOption(pf5020_handle_t *handle,
                                          uint8_t standbyOutputVolt,
                                          pf5020_buck_regulator_operate_mode_t standbyOperateMode);

/*!
 * @brief Set SW2 regulator phase shift value.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param phaseShift SW2 buck regulator phase shift value, please refer to @ref pf5020_buck_regulator_phase_shift_t
 *                   for details.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetPhaseShift(pf5020_handle_t *handle, pf5020_buck_regulator_phase_shift_t phaseShift);

/*!
 * @brief Enable/disable SW2 VTT operateion.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Used to enable/disable VTT operation.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_EnableVTTOperation(pf5020_handle_t *handle, bool enable);

/*!
 * @brief Set SW2 regulator fault detection related options.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param currentLimit SW2 buck regulator current limitation value, please refer to
 *                      @ref pf5020_buck_regulator_current_limit_t for details.
 * @param enableUVBypass Enable/disable UV bypass.
 * @param enableOVBypass Enable/disable OV bypass.
 * @param faultReEnabled Used to control whether return to sw1 regulator previous state if fault condition is cleared.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetFaultDetection(pf5020_handle_t *handle,
                                      pf5020_buck_regulator_current_limit_t currentLimit,
                                      bool enableUVBypass,
                                      bool enableOVBypass,
                                      bool faultReEnabled);

/*!
 * @brief Enable/disable PG monitor for SW2 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable PG monitor.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_EnablePGMonitor(pf5020_handle_t *handle, bool enable);

/*!
 * @brief Enable/disable watchdog bypass for SW2 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable watchdog bypass.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_EnableWatchDogBypass(pf5020_handle_t *handle, bool enable);

/* SWND1 Buck Regulator Control APIs. */
/*!
 * @brief Set SWND1 Buck regulator global configuration.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param config The pointer to @ref pf5020_swnd1_regulator_config_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetGlobalConfig(pf5020_handle_t *handle, const pf5020_swnd1_regulator_config_t *config);

/*!
 * @brief Set run/standby output voltage for SWND1 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param outputVolt The output voltage of SWND1 regulator in run/standby state,
 *                  please refer to @ref pf5020_swnd1_output_voltage_t for details.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetOutputVoltage(pf5020_handle_t *handle, pf5020_swnd1_output_voltage_t outputVolt);

/*!
 * @brief Set SWND1 regulator's operate mode in run and standby state.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param runOperateMode The operate mode of SWND1 in run state, please refer to @ref
 * pf5020_buck_regulator_operate_mode_t.
 * @param standbyOperateMode The operate mode of SWND1 in standby state, please refer to @ref
 * pf5020_buck_regulator_operate_mode_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetOperateMode(pf5020_handle_t *handle,
                                     pf5020_buck_regulator_operate_mode_t runOperateMode,
                                     pf5020_buck_regulator_operate_mode_t standbyOperateMode);

/*!
 * @brief Set SWND1 regulator phase shift value.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param phaseShift SWND1 buck regulator phase shift value, please refer to @ref pf5020_buck_regulator_phase_shift_t
 *                   for details.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetPhaseShift(pf5020_handle_t *handle, pf5020_buck_regulator_phase_shift_t phaseShift);

/*!
 * @brief Set SWND1 regulator fault detection related options.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param currentLimit SWND1 buck regulator current limitation value, please refer to
 *                      @ref pf5020_buck_regulator_current_limit_t for details.
 * @param enableUVBypass Enable/disable UV bypass.
 * @param enableOVBypass Enable/disable OV bypass.
 * @param faultReEnabled Used to control whether return to sw1 regulator previous state if fault condition is cleared.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetFaultDetection(pf5020_handle_t *handle,
                                        pf5020_buck_regulator_current_limit_t currentLimit,
                                        bool enableUVBypass,
                                        bool enableOVBypass,
                                        bool faultReEnabled);

