solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.h
/*!
 * @brief Enable/disable PG monitor for SWND1 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable PG monitor.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_EnablePGMonitor(pf5020_handle_t *handle, bool enable);

/*!
 * @brief Enable/disable watchdog bypass for SW1 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable watchdog bypass.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_EnableWatchDogBypass(pf5020_handle_t *handle, bool enable);

/* LDO1 Control APIs. */
/*!
 * @brief Set LDO1 global configuration.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param config The pointer to @ref pf5020_ldo1_regulator_config structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_SetGlobalConfig(pf5020_handle_t *handle, const pf5020_ldo1_regulator_config *config);

/*!
 * @brief Set LDO1 regulator's output voltage and operate mode in run state.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param runEnable Enable/disable LDO1 in run state.
 * @param runOuputVolt The output voltage of LDO1 in run state, please refer to @ref pf5020_ldo1_output_voltage_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_SetRunStateOption(pf5020_handle_t *handle,
                                       bool runEnable,
                                       pf5020_ldo1_output_voltage_t runOuputVolt);

/*!
 * @brief Set LDO1 regulator's output voltage and operate mode in standby state.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param standbyEnable Enable/disable LDO1 in standby state.
 * @param standbyOuputVolt The output voltage of LDO1 in standby state, please refer to @ref
 * pf5020_ldo1_output_voltage_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_SetStandbyStateOption(pf5020_handle_t *handle,
                                           bool standbyEnable,
                                           pf5020_ldo1_output_voltage_t standbyOuputVolt);

/*!
 * @brief Set SWND1 regulator fault detection related options.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enableILIMBypass Enable/disable ILIM bypass.
 * @param enableUVBypass Enable/disable UV bypass.
 * @param enableOVBypass Enable/disable OV bypass.
 * @param faultReEnabled Used to control whether return to ldos1 regulator previous state if fault condition is cleared.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_SetFaultDetection(
    pf5020_handle_t *handle, bool enableILIMBypass, bool enableUVBypass, bool enableOVBypass, bool faultReEnabled);

/*!
 * @brief Enable/disable PG monitor for LDO1 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable PG monitor.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_EnablePGMonitor(pf5020_handle_t *handle, bool enable);

/*!
 * @brief Enable/disable watchdog bypass for LDO1 regulator.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable watchdog bypass.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_EnableWatchDogBypass(pf5020_handle_t *handle, bool enable);

/*! @} */

/*! @name Fault Detection
 * @{
 */

/*!
 * @brief Set voltage monitor debounce time.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param uvDebounceTime UV monitor debounce time, please refer to @ref pf5020_uv_debounce_time_t.
 * @param ovDebounceTime OV monitor debounce time, please refer to @ref pf5020_ov_debounce_time_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetVoltageMonitorDebounceTime(pf5020_handle_t *handle,
                                              pf5020_uv_debounce_time_t uvDebounceTime,
                                              pf5020_ov_debounce_time_t ovDebounceTime);

/*!
 * @brief Enable/disable selected regulator's voltage monitor.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param name The regulator to be set.
 * @param enable Enable/disable voltage monitor.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_EnableVoltageMonitor(pf5020_handle_t *handle, pf5020_regulator_name_t name, bool enable);

/*!
 * @brief Set fault counter maximum value.
 *
 * @param handle Pointer to the @ref pf5020_handle_t structure.
 * @param maxValue Ranges from 0 to 15.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetFaultCounterMaxValue(pf5020_handle_t *handle, uint8_t maxValue);

/*!
 * @brief Get fault counter current value.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
uint8_t PF5020_GetFaultCounterCurrentValue(pf5020_handle_t *handle);

/*!
 * @brief Set the expire value of the fault timer, when a regulator experiences a fault event, a fault timer will start.
 *
 * @param handle Pointer to the @ref pf5020_handle_t structure.
 * @param expireValue The expire value of fault timer, ranges from 0 to 11, the actual expire time = 2 ^ expireValue.
 *
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetFaultTimerExpireValue(pf5020_handle_t *handle, uint8_t expireValue);

/*! @} */

