solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.h
/*! @name Watchdog Management
 * @{
 */

/*!
 * @brief Set reset behaviour asserted by WDI.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param wdiMode Used to control the WDI asserted performs a hard WD reset or soft WD reset.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_SetWDIMode(pf5020_handle_t *handle, pf5020_wdi_mode_t wdiMode);

/*!
 * @brief Enable/disable WDI watchdog event in standby state.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Used to control whether generate a watchdog event in standby mode if the WDI is asserted.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_EnableWDIStanby(pf5020_handle_t *handle, bool enable);

/*!
 * @brief Configure internal watchdog timer.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param config Pointer to @ref pf5020_wdog_internal_timer_config_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_ConfigInternalTimer(pf5020_handle_t *handle, const pf5020_wdog_internal_timer_config_t *config);

/*!
 * @brief Get cyclic counter current value.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @return Current cyclic counter value.
 */
uint8_t PF5020_WDOG_GetCyclicCounterValue(pf5020_handle_t *handle);

/*!
 * @brief Refresh internal watchdog timer.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_RefreshInternalTimer(pf5020_handle_t *handle);

/*!
 * @brief Set watchdog event counter maximum value.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param maxValue The maximum value of watchdog event counter.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_SetWDEventCounterMaxValue(pf5020_handle_t *handle, uint8_t maxValue);

/*!
 * @brief Get watchdog event counter current value.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @return Watch dog event counter current value.
 */
uint8_t PF5020_WDOG_GetWDEventCounterCurrentValue(pf5020_handle_t *handle);

/*! @} */

/*! @name Temperature Sensor
 * @{
 */

/*!
 * @brief Configure internal thermal monitor.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable temperature sensor circuit.
 * @param mode Used to set temperature sensor operate mode, please refer to @ref pf5020_temp_sensor_operate_mode_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_TMP_SetThermalMonitorConfig(pf5020_handle_t *handle,
                                            bool enable,
                                            pf5020_temp_sensor_operate_mode_t mode);

/*! @} */

/*! @name Analog Multiplexer Control APIs
 * @{
 */

/*!
 * @brief Configure analog multiplexer.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param enable Enable/disable analog multiplexer.
 * @param amuxSel Used to select amux output, please refer to @ref pf5020_amux_selection_t
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_AMUX_SetAnalogMuxConfig(pf5020_handle_t *handle, bool enable, pf5020_amux_selection_t amuxSel);

/*! @} */

/*! @name Interrupt Control
 * @{
 */

/*!
 * @brief Enable interrupts.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param interruptMask The mask of interrupts to clear, should be the OR'ed value of @ref pf5020_interrupt_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_EnableInterrupts(pf5020_handle_t *handle, uint64_t interruptMask);

/*!
 * @brief Disable Interrupts.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param interruptMask The mask of interrupts to clear, should be the OR'ed value of @ref pf5020_interrupt_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_DisableInterrupts(pf5020_handle_t *handle, uint64_t interruptMask);

/*!
 * @brief Get latched interrupts.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param interrptLatched Pointer to store the latched interrupt value.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_GetInterruptLatchStatus(pf5020_handle_t *handle, uint64_t *interrptLatched);

/*!
 * @brief Clear latched interrupts.
 *
 * @param handle The pointer to @ref pf5020_handle_t structure.
 * @param interruptMask The mask of interrupts to clear, should be the OR'ed value of @ref pf5020_interrupt_t.
 * @retval #kStatus_Success The transaction was started successfully.
 * @retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_ClearInterruptStatus(pf5020_handle_t *handle, uint64_t interruptMask);

/*! @} */

#endif /* _FSL_PF5020_H_ */
